Tekla Open API Reference for Tekla Structures 2025
ShapeItem.Export Method
 Exports the shape item in *.tsc-format to the to given file name. If path is not given shape is exported to model folder. If filename is empty shape name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool Export(
	ref string filename
)
Public Overridable Function Export (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the shape item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           ShapeItem item = new ShapeItem();
           string shapeName = "myShape";
           if (item.Select(shapeName))
           {
               string filename = System.IO.Path.GetTempPath() + "\\" + shapeName;
               if (item.Export(ref filename))
               {
                   Console.WriteLine("Shape item exported successfully");
               }
           }
       }
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace